// --створити масив:
// - з 5 числових значень
// - з 5 стрічкових значень
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль

let doc = [
    'doc-tape', 'tape', 'write', 'read', 'reed',
    30, 7, 2002, 3, 8,
    snb = [{string: 'door', number: 14, boolean: false},
        {string: 'door', number: 4, boolean: false},
        {string: 'door', number: 666, boolean: false},
        {string: 'door', number: 56, boolean: false},
        {string: 'door', number: 99, boolean: false}]
]

for (let docElement of doc) {
    console.log(docElement)
}

// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль

let abc =[
    'A','S','D','W'
]
console.log(abc[1])

// - є масив [2,17,13,6,22,31,45,66,100,-18] :

let n = [2,17,13,6,22,31,45,66,100,-18]

// 1. перебрати його циклом while

// let i = 0;
// while (i < n.length) {
//     console.log(n[i])
//     i++
// }

// 2. перебрати його циклом for

// for (let i = 0; i < n.length; i++) {
//     let nElement = n[i];
//     console.log(nElement)
// }

// 3. перебрати циклом while та вивести числа тільки з непарним індексом

// let i = 1;
// while (i < n.length) {
//     console.log(n[i])
//     i += 2
// }

// 4. перебрати циклом for та вивести числа тільки з непарним індексом

// for (let i = 1; i < n.length; i +=2) {
//     let nElement = n[i];
//     console.log(nElement)
// }

// 5. перебрати циклом while та вивести числа тільки парні значення

let i = 0;
while (i < n.length) {
    if (n[i] / 2 ) {
        console.log(n[i])
    }
    i++
}

// 6. перебрати циклом for та вивести числа тільки парні значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор